Revit 2027 API
RevitCommandId.HasBinding Property
 Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasBinding { get; }
Public ReadOnly Property HasBinding As Boolean
	Get
public:
property bool HasBinding {
	bool get ();
}
member HasBinding : bool with get
Property Value
Boolean
Remarks
 This will not indicate if one or more applications have subscribed to the BeforeExecuted event, as this event is not limited to a single subscriber.
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace